"""1) Создать класс TrafficLight (светофор)
и определить у него один атрибут color
(цвет) и метод running (запуск). Атрибут
реализовать как приватный. В рамках
метода реализовать переключение
светофора в режимы: красный, желтый,
зеленый. Продолжительность первого
состояния (красный) составляет 7 секунд,
второго (желтый) — 2 секунды, третьего
(зеленый) — на ваше усмотрение.
Переключение между режимами
должно осуществляться только в
указанном порядке (красный, желтый,
зеленый). Проверить работу примера,
создав экземпляр и вызвав описанный
метод."""

from time import sleep

class TrafficLight:
    __color = ["красный", "желтый",
                "зелёный"]

    def running(self):
        count = 0
        while count < 3:
            print(TrafficLight.__color[count])
            if count == 0:
                sleep(7)
            if count == 1:
                sleep(2)
            if count == 2:
                sleep(10)
                self.running()
            count +=1


tl = TrafficLight()
tl.running()

